# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # expand model depth
width_multiple: 1.25  # expand layer channels

# anchors
anchors:
  - [13,17,  22,25,  27,66,  55,41]  # P3/8
  - [57,88,  112,69,  69,177,  136,138]  # P4/16
  - [136,138,  287,114,  134,275,  268,248]  # P5/32
  - [268,248,  232,504,  445,416,  640,640]  # P6/64
  - [812,393,  477,808,  1070,908,  1408,1408]  # P7/128

# csp p7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1], False],  # 0
   [-1, 1, Conv, [64, 3, 2], False],  # 1-P1/2
   [-1, 1, BottleneckCSP, [64], False],
   [-1, 1, Conv, [128, 3, 2], False],  # 3-P2/4
   [-1, 3, BottleneckCSP, [128], False],
   [-1, 1, Conv, [256, 3, 2], False],  # 5-P3/8
   [-1, 15, BottleneckCSP, [256], False],
   [-1, 1, Conv, [512, 3, 2], False],  # 7-P4/16
   [-1, 15, BottleneckCSP, [512], False],
   [-1, 1, Conv, [1024, 3, 2], False], # 9-P5/32
   [-1, 7, BottleneckCSP, [1024], False],
   [-1, 1, Conv, [1024, 3, 2], False], # 11-P6/64
   [-1, 7, BottleneckCSP, [1024], False],
   [-1, 1, Conv, [1024, 3, 2], False], # 13-P7/128
   [-1, 7, BottleneckCSP, [1024], False],  # 14
  ]

# csp p7 head
# na = len(anchors[0])
head:
  [[-1, 1, SPPCSP, [512], False], # 15
   [-1, 1, Conv, [512, 1, 1], False],
   [-1, 1, nn.Upsample, [None, 2, 'nearest'], False],
   [-6, 1, Conv, [512, 1, 1], False], # route backbone P6
   [[-1, -2], 1, Concat, [1], False],
   [-1, 3, BottleneckCSP2, [512], False], # 20 
   [-1, 1, Conv, [512, 1, 1], False],
   [-1, 1, nn.Upsample, [None, 2, 'nearest'], False],
   [-13, 1, Conv, [512, 1, 1], False], # route backbone P5
   [[-1, -2], 1, Concat, [1], False],
   [-1, 3, BottleneckCSP2, [512], False], # 25
   [-1, 1, Conv, [256, 1, 1], False],
   [-1, 1, nn.Upsample, [None, 2, 'nearest'], False],
   [-20, 1, Conv, [256, 1, 1], False], # route backbone P4
   [[-1, -2], 1, Concat, [1], False],
   [-1, 3, BottleneckCSP2, [256], False], # 30
   [-1, 1, Conv, [128, 1, 1], False],
   [-1, 1, nn.Upsample, [None, 2, 'nearest'], False],
   [-27, 1, Conv, [128, 1, 1], False], # route backbone P3
   [[-1, -2], 1, Concat, [1], False],
   [-1, 3, BottleneckCSP2, [128], False], # 35
   [-1, 1, Conv, [256, 3, 1], False],
   [-2, 1, Conv, [256, 3, 2], False],
   [[-1, 30], 1, Concat, [1], False],  # cat
   [-1, 3, BottleneckCSP2, [256], False], # 39
   [-1, 1, Conv, [512, 3, 1], False],
   [-2, 1, Conv, [512, 3, 2], False],
   [[-1, 25], 1, Concat, [1], False],  # cat
   [-1, 3, BottleneckCSP2, [512], False], # 43
   [-1, 1, Conv, [1024, 3, 1], False],
   [-2, 1, Conv, [512, 3, 2], False],
   [[-1, 20], 1, Concat, [1], False],  # cat
   [-1, 3, BottleneckCSP2, [512], False], # 47
   [-1, 1, Conv, [1024, 3, 1], False],
   [-2, 1, Conv, [512, 3, 2], False],
   [[-1, 15], 1, Concat, [1], False],  # cat
   [-1, 3, BottleneckCSP2, [512], False], # 51
   [-1, 1, Conv, [1024, 3, 1], False],

   [[36,40,44,48,52], 1, Detect, [nc, anchors, 784], True],   # Detect(P3, P4, P5, P6, P7)
  ]
  
#basis module
basis:
  # [from, number, module, args]
  [[4, 1, ConvKaimingUniform, [128, 3, 1], False], # 54
   [-1, 3, ConvKaimingUniform, [128, 3, 1], False],
   [-1, 1, nn.Upsample, [None, 2, 'bilinear'], False],
   [-1, 1, ConvKaimingUniform, [128, 3, 1], False],
   [-1, 1, nn.Conv2d, [4, 1], True],
  ]