# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # expand model depth
width_multiple: 1.0  # expand layer channels

# anchors
anchors:
  - [13,17,  31,25,  24,51, 61,45]  # P3/8
  - [61,45,  48,102,  119,96, 97,189]  # P4/16
  - [97,189,  217,184,  171,384, 324,451]  # P5/32
  - [324,451, 545,357, 616,618, 1024,1024]  # P6/64

# csp p6 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1], False],  # 0
   [-1, 1, Conv, [64, 3, 2], False],  # 1-P1/2
   [-1, 1, BottleneckCSP, [64], False],
   [-1, 1, Conv, [128, 3, 2], False],  # 3-P2/4
   [-1, 3, BottleneckCSP, [128], False],
   [-1, 1, Conv, [256, 3, 2], False],  # 5-P3/8
   [-1, 15, BottleneckCSP, [256], False],
   [-1, 1, Conv, [512, 3, 2], False],  # 7-P4/16
   [-1, 15, BottleneckCSP, [512], False],
   [-1, 1, Conv, [1024, 3, 2], False], # 9-P5/32
   [-1, 7, BottleneckCSP, [1024], False],
   [-1, 1, Conv, [1024, 3, 2], False], # 11-P6/64
   [-1, 7, BottleneckCSP, [1024], False],  # 12
  ]

# csp p6 head
# na = len(anchors[0])
head:
  [[-1, 1, SPPCSP, [512], False], # 13
   [-1, 1, Conv, [512, 1, 1], False],
   [-1, 1, nn.Upsample, [None, 2, 'nearest'], False],
   [-6, 1, Conv, [512, 1, 1], False], # route backbone P5
   [[-1, -2], 1, Concat, [1], False],
   [-1, 3, BottleneckCSP2, [512], False], # 18 
   [-1, 1, Conv, [256, 1, 1], False],
   [-1, 1, nn.Upsample, [None, 2, 'nearest'], False],
   [-13, 1, Conv, [256, 1, 1], False], # route backbone P4
   [[-1, -2], 1, Concat, [1], False],
   [-1, 3, BottleneckCSP2, [256], False], # 23
   [-1, 1, Conv, [128, 1, 1], False],
   [-1, 1, nn.Upsample, [None, 2, 'nearest'], False],
   [-20, 1, Conv, [128, 1, 1], False], # route backbone P3
   [[-1, -2], 1, Concat, [1], False],
   [-1, 3, BottleneckCSP2, [128], False], # 28
   [-1, 1, Conv, [256, 3, 1], False],
   [-2, 1, Conv, [256, 3, 2], False],
   [[-1, 23], 1, Concat, [1], False],  # cat
   [-1, 3, BottleneckCSP2, [256], False], # 32
   [-1, 1, Conv, [512, 3, 1], False],
   [-2, 1, Conv, [512, 3, 2], False],
   [[-1, 18], 1, Concat, [1], False],  # cat
   [-1, 3, BottleneckCSP2, [512], False], # 36
   [-1, 1, Conv, [1024, 3, 1], False],
   [-2, 1, Conv, [512, 3, 2], False],
   [[-1, 13], 1, Concat, [1], False],  # cat
   [-1, 3, BottleneckCSP2, [512], False], # 40
   [-1, 1, Conv, [1024, 3, 1], False],

   [[29,33,37,41], 1, Detect, [nc, anchors, 784], True],   # Detect(P3, P4, P5, P6)
  ]
  