# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # expand model depth
width_multiple: 1.0  # expand layer channels

# anchors
anchors:
  - [13,17,  31,25,  24,51, 61,45]  # P3/8
  - [61,45,  48,102,  119,96, 97,189]  # P4/16
  - [97,189,  217,184,  171,384, 324,451]  # P5/32
  - [324,451, 545,357, 616,618, 1024,1024]  # P6/64

# cspdarknet53 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [48, 3, 2]],  # 0
   [-1, 1, Conv, [96, 3, 1]],  # 1-P1/2
   [-1, 1, Conv, [96, 3, 2]],  # 2
   [-1, 1, HarDBlock, [24, 1.7, 8]],
   [-1, 1, Conv, [192, 3, 2]],  # 4-P3/8
   [-1, 1, HarDBlock, [24, 1.7, 16]],
   [-1, 1, Conv, [256, 3, 1]],  # 6-P3/8
   [-1, 1, HarDBlock, [28, 1.7, 16]],
   [-1, 1, Conv, [320, 3, 2]],  # 8-P4/16
   [-1, 1, HarDBlock, [36, 1.7, 16]],
   [-1, 1, Conv, [480, 3, 2]],  # 10-P5/16
   [-1, 1, HarDBlock, [48, 1.7, 16]],
   [-1, 1, Conv, [720, 3, 2]], # 12-P6/32
   [-1, 1, HarDBlock, [256, 1.7, 4]],
   [-1, 1, Conv, [1280, 3, 1]], # 14-P6/32
  ]

# yolov4l head
# na = len(anchors[0])
head:
  [[-1, 1, SPPCSP, [512]], # 15
   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [-7, 1, Conv, [512, 1, 1]], # route backbone P5
   [[-1, -2], 1, Concat, [1]],
   [-1, 3, BottleneckCSP2, [512]], # 20
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [-14, 1, Conv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   [-1, 3, BottleneckCSP2, [256]], # 25
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [-21, 1, Conv, [128, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   [-1, 3, BottleneckCSP2, [128]], # 30
   [-1, 1, Conv, [256, 3, 1]],
   [-2, 1, Conv, [256, 3, 2]],
   [[-1, 25], 1, Concat, [1]],  # cat
   [-1, 3, BottleneckCSP2, [256]], # 34
   [-1, 1, Conv, [512, 3, 1]],
   [-2, 1, Conv, [512, 3, 2]],
   [[-1, 20], 1, Concat, [1]],  # cat
   [-1, 3, BottleneckCSP2, [512]], # 38
   [-1, 1, Conv, [1024, 3, 1]],
   [-2, 1, Conv, [512, 3, 2]],
   [[-1, 15], 1, Concat, [1]],  # cat
   [-1, 3, BottleneckCSP2, [512]], # 42
   [-1, 1, Conv, [1024, 3, 1]],

   [[31,35,39,43], 1, Detect, [nc, anchors]],   # Detect(P3, P4, P5, P6)
  ]
