# parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov4s backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1], False],  # 0
   [-1, 1, Conv, [64, 3, 2], False],  # 1-P1/2
   [-1, 1, Bottleneck, [64], False],
   [-1, 1, Conv, [128, 3, 2], False],  # 3-P2/4
   [-1, 2, BottleneckCSP, [128], False],
   [-1, 1, Conv, [256, 3, 2], False],  # 5-P3/8
   [-1, 8, BottleneckCSP, [256], False],
   [-1, 1, Conv, [512, 3, 2], False],  # 7-P4/16
   [-1, 8, BottleneckCSP, [512], False],
   [-1, 1, Conv, [1024, 3, 2], False], # 9-P5/32
   [-1, 4, BottleneckCSP, [1024], False],  # 10
  ]

# yolov4s head
# na = len(anchors[0])
head:
  [[-1, 1, SPPCSP, [512], False], # 11
   [-1, 1, Conv, [256, 1, 1], False],
   [-1, 1, nn.Upsample, [None, 2, 'nearest'], False],
   [8, 1, Conv, [256, 1, 1], False], # route backbone P4
   [[-1, -2], 1, Concat, [1], False],
   [-1, 2, BottleneckCSP2, [256], False], # 16
   [-1, 1, Conv, [128, 1, 1], False],
   [-1, 1, nn.Upsample, [None, 2, 'nearest'], False],
   [6, 1, Conv, [128, 1, 1], False], # route backbone P3
   [[-1, -2], 1, Concat, [1], False],
   [-1, 2, BottleneckCSP2, [128], False], # 21
   [-1, 1, Conv, [256, 3, 1], False],
   [-2, 1, Conv, [256, 3, 2], False],
   [[-1, 16], 1, Concat, [1], False],  # cat
   [-1, 2, BottleneckCSP2, [256], False], # 25
   [-1, 1, Conv, [512, 3, 1], False],
   [-2, 1, Conv, [512, 3, 2], False],
   [[-1, 11], 1, Concat, [1], False],  # cat
   [-1, 2, BottleneckCSP2, [512], False], # 29
   [-1, 1, Conv, [1024, 3, 1], False],

   [[22,26,30], 1, Detect, [nc, anchors, null], True],   # Detect(P3, P4, P5)
  ]
